{"inkVersion":20,"root":[[{"->":"Main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"speaker":[{"temp=":"emotion"},{"temp=":"name"},"ev","void","/ev","~ret",{"#f":1}],"background":[{"temp=":"name"},"ev","void","/ev","~ret",{"#f":1}],"Main":[["ev","str","^lil_village","/str",{"x()":"background","exArgs":1},"out","/ev","\n","ev","str","^narrator","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^Walking, walking...","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"Intro"},{"#f":5}]}],{"#f":1}],"Intro":[["^The clinging of metal work breaking the silence of dawn.","\n","^A lone light slowly approached the settlement.","\n","^Even as the sun rose, the the colossal monument of another age casted long shadows upon every house, tree and person.","\n","^Towering the very notion of earth, its seemingly ever growing semblance drew the robot closer and closer.","\n","^The unstable flame reverbered with each step, making the tall shadows of dead vegetation and pointy rocks dance at its own rythm.","\n","^When the skies finally put the darkness to rest, the young robot arrived at the place he somehow felt was his destiny all along, after travelling weeks nonstop.","\n","^On the close horizon, a structure so unconceivably big, humanity had never fully understood the sheer size of it.","\n","^Rather, it was always seem as a pillar unifying earth and heavens. A tower that went up seemingly endlessly, until its very peak pierced the veil of the earthly realm.","\n","^At the base of the immensurable monolith, a small village that seemingly attracted those who became fascinated with the outwordly wonder.","\n","^You are one of those people. Although, \"people\" or better, \"person\", is a term you are not so sure fits you.","\n",["ev",{"^->":"Intro.0.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^What am I?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Intro.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.20.s"},[{"#n":"$r2"}],"\n",{"->":"AlexDescription"},{"#f":5}]}],{"#f":1}],"AlexDescription":[["^That's something you've been asking yourself for quite a while now. With a metallic body which color is between brass and bronze, you sure doesn't have the flesh of a human.","\n","^Big, pupilless(?) eyes cover most of yout face, letting light through them. Its source? The closest thing one may find you have in common with a human: a core ablaze, what the one who took care of you called a heart. Even though in your case, it's literally fire within a glass vessel, your old man assured you that was proof of a beating heart, of a lively spirit.","\n","^But after his death, you've been ceaselessly wondering... Does that make you a real person?","\n","^You can only hope the place your body is almost automatically taking you to has the answers for that.","\n","^So onward you go.","\n","ev","str","^Enter the Village","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"Chapter1"},{"#f":5}]}],{"#f":1}],"Chapter1":[["ev","str","^lil_village","/str",{"x()":"background","exArgs":1},"out","/ev","\n","^You then enter the village.","\n","^The first thing you notice is that its entrance doesn't do justice to whats ahead. In fact, for a place that is the last settlement of the entire kingdom, it is more inhabited than one would expect.","\n","^Curiously enough, there's only a handful of conventional houses, built from bricks, stone and wood. Rather, the vast majority of housing is composed by what could be explained as improvised shelter: fabric tents, hay woods and stationary caravans flood the land that otherwise would seemingly be empty.","\n","^Since it's early, not many people are wandering out of their cozy huts.","\n","^Thanks to your eyes, which, according to your old man, can see much more than anyone else's, you spot some movement towards a tall building, one of the few made with stone, what makes you presume it's one of the village original buildings.","\n","^You decide to investigate.","\n","ev","str","^Approach the building","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"Approachingchurch"},{"#f":5}]}],{"#f":1}],"Approachingchurch":["^You get closer and closer.","\n","^The structure is taller than any other building around, improvised or not. At first glance, it appears as a big house with a tower anexed at one of the ends.","\n","^Both at the tower and over what you presume to be the main entrance of it, there's ornamented, colored glass, arranged just as if it was a painting.","\n","^At its front, a small group of people were either sitting or kneeling in a semicircular order.","\n","^You get even closer, and then, a man in white robes with a three-colors jeweled hat suddenly stops what you presume were whispering dialogues. His eyes meet yours, and his mouth is kept open.","\n","^Noticing the silence, the low headed crowd turn their heads to you. Some stay in place, some suddenly get up and hide, and a single man steadily raises and walks towards you, hand resting on his sword's hilt.","\n","^You gasp. He seems to notice that, and hesitates one step.","\n","ev","str","^galego","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"Who comes there? What art thou?\"","\n","ev","str","^alex","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"Hello! I... Uh... I'm Alex! Nice to... meet you?","\n","ev","str","^galego","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"Alex? What are you exactly?\" Asked Lucius, carefully examining you.","\n","ev","str","^alex","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"I'm a metal person?\"","\n","ev","str","^galego","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^The tall armored warrior notices the lack of confidence in your words. You feel his gaze getting increasingly inquisitive.","\n",{"->":"whatswrongquestions"},{"#f":1}],"whatswrongquestions":[["ev","str","^What's wrong?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Automation?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^\"Well... I didn't expect to meet a refined automation here. Did some mage send you to explore the Etrmnuk on their behalf?","\n",{"->":"Etrmnuk_ask"},{"#f":5}],"c-1":["\n",{"->":"Automation_Ask"},{"#f":5}]}],{"#f":1}],"Automation_Ask":["ev","str","^galego","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"Aren't you one?\"","\n","ev","str","^alex","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"I'm...\"","\n","ev","str","^galego","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"I don't know much about automations, other than the appearance. And you look like one. At least, from what I've seen and heard.","\n",{"->":"whatswrongquestions"},{"#f":1}],"Etrmnuk_ask":[["ev","str","^Etrmnuk?","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev","str","^galego","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^That absurdly big tower that casts such a colossal shadow at this village.","\n","^And, frankly, the most plausible reason for someone to come around here.","\n",{"->":"Ruins"},{"#f":5}]}],{"#f":1}],"Ruins":[["ev","str","^ruins","/str",{"x()":"background","exArgs":1},"out","/ev","\n","ev","str","^narrator","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^You and Lucius arrive at the ruins surrounding the tower's base.","\n","^The architecture looks definitely older than the tower itself, and the vast majority of buildings has been lost to time.","\n","^Some of it even seem to have sank in the arid soil for quite some time now. In fact, there isn't a single ruin that seems as tall as the village church.","\n","^Even from the beginning of the archeological site, you see Etrmnuk's entrance: It is a huge metal gate on a even bigger wall, that seemingly serves as the tower base.","\n","^The closer you get, the more you think how little you are, approaching the imponent gate.","\n","^Yet...","\n","^Something... You feel like something about it resonates with you.","\n","^You and Lucius walk straight to that gate, ocasionally contemplating the sight around while keeping a steady pace.","\n","^Eight or so meters before the gate, you hear a voice.","\n","^\"Halt!\" a feminine voice says. A tall young woman with long brown curls, partially covered by a pointy hat appears. She has dark skin with contrasting golden jewlery wrapped around her delicated neck.","\n","^The shining of the gold, however, is agressively ofuscated by her piercing amber eyes, striking so deeply you think you feel the flame in your core flick for a second.","\n","ev","str","^mandacaru","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^I'm taking this morning to study the ruins. Alone. All by myself. No peeps allowed.","\n","^That includes you, cleric.","\n","ev","str","^galego","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^Galego looks somewhat irritated.","\n","^\"I'm a paladin of the Three Goddesses Church, thank you very much! And by who's permission have you reserved this place for yourself, may I ask?\"","\n","ev","str","^mandacaru","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"That's why your hat is so funny! It's supposed to be armor? Hilarious!\" she says with a smug. \"And, to answer question: by my own. I'm a powerful woman with ambitious desires, if you haven't noticed!\"","\n","^Suddenly, she seems to get interested in you.","\n","^\"And I don't suppose this exotic fine piece of craft belongs to you, right?\"","\n","^You're taken by surprise.","\n","ev","str","^alex","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"Hi... My name is Alex!\"","\n","ev","str","^mandacaru","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"Oooh... The cute thing has a name. A very human sounding on top of that!\" She says as she bends towards you smiling.","\n","^\"I never studied automation crafting as deep as I could, but I used to play a bit with that in the academy when I got bored.\"","\n","^\"So I know enough about the art to know you, Alex, was built in a very interesting way. But I do wonder: for what purpose?\"","\n","^Before you or Lucius can say anything, she cuts both of you.","\n","^\"By the way, I'm Mandacaru Silva, royal mage of the high court of Baywoulg. Enchanted.\" she says, again with the smug.","\n","ev","str","^galego","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"I am Val. Galego Lucius Varium, of the Three Goddesses Church.\"","\n","ev","str","^mandacaru","/str","str","^neutral","/str",{"x()":"speaker","exArgs":2},"out","/ev","\n","^\"Yeah yeah, I noticed. I can recognize a man of the church in a instant:","\n","^Pompous","\n","^But actually not that classy...","\n","^High posture","\n","^As if they lived on a high horse...","\n","^...And that attitude of \"I'm a beacon of morality and goodness for society!\"","\n","^Also, the clichê of a tall, blonde man in armor speaking in a very formal way, as if his tongue was incapable of saying meaningful warm things!\"","\n","^END OF STORY CURRENTLY","\n","ev","str","^Guess what?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"Guesswhat"},{"#f":5}]}],{"#f":1}],"Guesswhat":[["ev","str","^ancient-city","/str",{"x()":"background","exArgs":1},"out","/ev","\n","^Quem quer saber? Nony ou Dinha?","\n",["ev",{"^->":"Guesswhat.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Dinha",{"->":"$r","var":true},null]}],"ev","str","^Nony","/str","/ev",{"*":".^.c-1","flg":20},["ev",{"^->":"Guesswhat.0.17.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^Cley ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Guesswhat.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":"Dinha"},{"#f":5}],"c-1":["\n",{"->":"Nony"},{"#f":5}],"c-2":["ev",{"^->":"Guesswhat.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.17.s"},[{"#n":"$r2"}],"\n",{"->":"Cley"},{"#f":5}]}],{"#f":1}],"Dinha":[["^Cunha","\n","ev","str","^... Uh?","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^Oi Cunha Dinha <3","\n","^Bah dum tss!","\n","done",{"#f":5}]}],{"#f":1}],"Nony":["^EU TE AMO MOZÃO <3","\n","^Demais demais mesmo, muito muito muito, sério mesmo :3","\n","^Casa comigo? <3","\n","^Teu Agnus. :3","\n","end",{"#f":1}],"Cley":[[["ev",{"^->":"Cley.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^More",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Cley.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^BOOM.","\n","^(Cleymore, bomba...)","\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}